0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    prePlate
    {
        type            symmetryPlane;
    }
    plate
    {
        type            boundaryCorrectedFixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
