0/include/freestreamConditions
U (5.4 0 0);
p 101325;
T 300;
