0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.0482119776;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0482119776;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
    prePlate
    {
        type            symmetryPlane;
    }
    plate
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
