0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 270;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 270;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
    prePlate
    {
        type            symmetryPlane;
    }
    plate
    {
        type            omegaWallFunction;
        value           uniform 270;
    }
    frontAndBack
    {
        type            empty;
    }
}
