constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       126925;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       127075;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          425;
        startFace       127225;
    }
    prePlate
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          75;
        startFace       127650;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350;
        startFace       127725;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          127500;
        startFace       128075;
    }
)

// ************************************************************************* //
