system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// T3A paper domain: [-0.05,2] x [0,0.2] m; leading edge at x=0.
// Clean Grid03-like mesh: pre-plate 75 cells, plate 350 cells, wall-normal 150 cells.
// y simpleGrading ratio 892.414074054 gives first-cell height approx 1e-5 m over 0.2 m with 150 cells.
vertices
(
    (-0.05 0.0 0.0)
    ( 0.00 0.0 0.0)
    ( 2.00 0.0 0.0)
    (-0.05 0.2 0.0)
    ( 0.00 0.2 0.0)
    ( 2.00 0.2 0.0)
    (-0.05 0.0 0.01)
    ( 0.00 0.0 0.01)
    ( 2.00 0.0 0.01)
    (-0.05 0.2 0.01)
    ( 0.00 0.2 0.01)
    ( 2.00 0.2 0.01)
);

blocks
(
    hex (0 1 4 3 6 7 10 9)  (75 150 1)  simpleGrading (1 892.414074054 1)
    hex (1 2 5 4 7 8 11 10) (350 150 1) simpleGrading (1 892.414074054 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 9 6));
    }
    outlet
    {
        type patch;
        faces ((2 8 11 5));
    }
    top
    {
        type symmetryPlane;
        faces ((3 4 10 9) (4 5 11 10));
    }
    prePlate
    {
        type symmetryPlane;
        faces ((0 6 7 1));
    }
    plate
    {
        type wall;
        faces ((1 7 8 2));
    }
    frontAndBack
    {
        type empty;
        faces ((0 1 4 3) (1 2 5 4) (6 9 10 7) (7 10 11 8));
    }
);

mergePatchPairs
(
);
