system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

fluxScheme      AUSMPlusUp;

ddtSchemes
{
    default         bounded dualTime rPseudoDeltaT steadyState;
}

gradSchemes
{
    default         cellLimited faceLeastSquares linear 0.6;
    gradTVD         faceLeastSquares linear;

    grad(U)         cellLimited faceLeastSquares linear 0.6;
    grad(k)         cellLimited Gauss linear 0.9;
    grad(omega)     cellLimited Gauss linear 0.9;
    grad(gammaInt)  cellLimited Gauss linear 0.9;
    grad(ReThetat)  cellLimited Gauss linear 0.9;
}

divSchemes
{
    default             none;

    div(tauMC)          Gauss linear;

    // Hocanın dediği first-order/limited stabilizasyon:
    div(phi,k)          bounded Gauss upwind;
    div(phi,omega)      bounded Gauss upwind;
    div(phi,gammaInt)   bounded Gauss upwind;
    div(phi,ReThetat)   bounded Gauss upwind;
}

laplacianSchemes
{
    default             Gauss linear corrected;
    laplacian(muEff,U)  Gauss linear compact;
    laplacian(alphaEff,e) Gauss linear compact;
}

interpolationSchemes
{
    default             linear;

    // HiSA manual recommended reconstruction
    reconstruct(rho)    wVanLeer gradTVD;
    reconstruct(U)      wVanLeer gradTVD;
    reconstruct(T)      wVanLeer gradTVD;
}

snGradSchemes
{
    default             corrected;
}

wallDist
{
    method              Poisson;
}
